
#include "version.h"

char const *SkyMPC_Version = "1.5.4";
int const SkyMPC_Year = 2016;

/*

1.5.4 (2015-10-26)
	・認証に対応

1.5.3.1 (2015-10-14)

	・ソースコードの一部にC++11の文法を使用
	・Windows版はMSVC2015を採用

1.5.3 (2015-07-11)

	・Qt5.5.0を採用。
	・接続ダイアログボックスの挙動を改善。
	・Windows版はスタティックリンクするようにした。

1.5.2 (2015-03-14)

	・ステータスバーを常に表示するようにした。
	・Windows版でコンパイラのバージョン指定が間違っていたので、コンパイルし直した。

1.5.1 (2015-02-06)

	・開発環境を移行：Qt5.4
	・ツリービューの見た目を変更

1.5.0 (2015-01-05)

	・プレイリストの重複削除機能を搭載
	・プレイリストの自動削除機能に対応

1.4.0 (2014-09-16)


	・クイックセーブ機能を搭載
	・接続ダイアログボックスを改良
	・Linux版を公開

1.3.0 (2014-03-21)

	・ファンクションキーの割り当てを変更
	・通信タイムアウトの判定を緩和
	・Mac OS X版を公開

1.2.0 (2013-12-01)

	・複数のMPDサーバを管理していて、コンボボックスで切り替えたとき、ボリュームコントロールの有効無効が正しく行われなかった不具合を修正。
	・コンパイラをVC2010からVC2008に変更。

1.1.0 (2013-10-25)

	・右ペインにフォーカスがあって曲を選択している状態でEnterを押すとその曲を再生するようにした。

1.0.0 (2013-07-27)


*/
